lkolbly/cmsis-svd/data/Atmel/ATSAM4CMP32C_1.svd
        <register>
          <name>SCHMITT</name>
          <description>Schmitt Trigger Register</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCHMITT0</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT1</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT2</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT3</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT4</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT5</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT6</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT7</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT8</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT9</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT10</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT11</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT12</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT13</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT14</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT15</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT16</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT17</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT18</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT19</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT20</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT21</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT22</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT23</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT24</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT25</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT26</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT27</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT28</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT29</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT30</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT31</name>
              <description>Schmitt Trigger Control</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRIVER1</name>
          <description>I/O Drive Register 1</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LINE0</name>
              <description>Drive of PIO Line 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE1</name>
              <description>Drive of PIO Line 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE2</name>
              <description>Drive of PIO Line 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE3</name>
              <description>Drive of PIO Line 3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE4</name>
              <description>Drive of PIO Line 4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE5</name>
              <description>Drive of PIO Line 5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE6</name>
              <description>Drive of PIO Line 6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE7</name>
              <description>Drive of PIO Line 7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE8</name>
              <description>Drive of PIO Line 8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE9</name>
              <description>Drive of PIO Line 9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE10</name>
              <description>Drive of PIO Line 10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE11</name>
              <description>Drive of PIO Line 11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE12</name>
              <description>Drive of PIO Line 12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE13</name>
              <description>Drive of PIO Line 13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE14</name>
              <description>Drive of PIO Line 14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE15</name>
              <description>Drive of PIO Line 15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
